app/controllers/books_controller.rb

SELECT `books`.* FROM `books` ORDER BY created_at DESC
---
    def index
      @books = Book.all.order("created_at")

INSERT INTO `books` (`title`, `description`, `author`, `created_at`, `updated_at`, `user_id`) VALUES ('Sample 3', 'Sample 3', 'Sample 3', '2018-03-11 12:10:11', '2018-03-11 12:10:11', 1)
---
    def create
      @book = current_user.books.build(book_params)
      if @book.save

UPDATE `books` SET `title` = 'The Monk Who Sold His Ferrari ', `description` = 'Everyone loves a good fable, and this is certainly one. The protagonist is Julian Mantle, a high-profile attorney with a whacked-out schedule and a shameful set of spiritual priorities. Of course it takes a crisis (heart attack) to give Mantle pause. And pause he does--suddenly selling all his beloved possessions to trek India in pursuit of a meaningful existence. The Himalayan gurus along the way give simple advice, such as, \"What lies behind you and what lies before you is nothing compared to what lies within you.\" Yet it is easy to forgive the story\'s simplicity because each kernel of wisdom is framed to address the persistent angst of Western white-collar professionals.', `author` = 'Robin Sharma ', `updated_at` = '2018-03-11 07:07:00' WHERE `books`.`id` = 1
---
    def update
      if @book.update(book_params)

DELETE FROM `books` WHERE `books`.`id` = 2
---
    def destroy
      @book.destroy

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
---
    def find_book
      @book = Book.find(params[:id])